
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
		ИзменитьВидимостьРеквизитов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
		ИзменитьВидимостьРеквизитов();
КонецПроцедуры  


&НаСервере
Процедура ИзменитьВидимостьРеквизитов();  
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
		Элементы.ВКМ_АбоненсткаяПлата.Видимость = Истина; 
		Элементы.ВКМ_НачалоДействия.Видимость = Истина;
		Элементы.ВКМ_ОкончаниеДействия.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
	Иначе  
		Объект.ВКМ_АбоненсткаяПлата = Неопределено; 
		Объект.ВКМ_НачалоДействия = Неопределено;
		Объект.ВКМ_ОкончаниеДействия = Неопределено;
		Объект.ВКМ_СтоимостьЧаса = Неопределено;

		Элементы.ВКМ_АбоненсткаяПлата.Видимость = Ложь; 
		Элементы.ВКМ_НачалоДействия.Видимость = Ложь;
		Элементы.ВКМ_ОкончаниеДействия.Видимость = Ложь; 
		Элементы.ВКМ_СтоимостьЧаса.Видимость = Истина;
	КонецЕсли;

	
КонецПроцедуры
