#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
		
		
		ТЗ_Отпуск = ОтпускаСотрудников.Выгрузить(,"Сотрудник, КолВоДней");
		ТЗ_Отпуск.Свернуть("Сотрудник","КолВоДней");
		
		Для Каждого СтрокаТЗ Из ТЗ_Отпуск Цикл   
			
			Движение = Движения.ВКМ_ОтпускаСотрудников.ДобавитьПриход();
			
			Движение.Год = НачалоГода(Год);
			Движение.Период = НачалоГода(Год);
			Движение.Сотрудник = СтрокаТЗ.Сотрудник;
			Движение.ДнейОтпуска = СтрокаТЗ.КолВоДней;
			
		КонецЦикла; 
		
		Движения.ВКМ_ОтпускаСотрудников.Записать(Истина);
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		
		Отбор = Новый Структура;
		Отбор.Вставить("фл_ПодсветитьСтроку", Истина);
		
		НайденныеСтроки = ОтпускаСотрудников.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			Сотрудник = Неопределено;
			Для Каждого Строка Из НайденныеСтроки Цикл	
				Если Строка.Сотрудник <> Сотрудник Тогда
					Сотрудник = Строка.Сотрудник;
					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для сотрудника %1 указано кол-во дней отпуска больше 28 дней", Сотрудник));
				Иначе
					Продолжить;
				КонецЕсли;
			КонецЦикла;    
			Отказ = Истина;
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
		
		
		Ответственный = Пользователи.ТекущийПользователь();
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли

