#Область ОбработчикиСобытийЭлементовТАБЛИЦЫФормыОсновныеНачисления

&НаКлиенте
Процедура ОсновныеНачисленияСотрудникПриИзменении(Элемент)
	ТекушиеДанные = Элементы.ОсновныеНачисления.ТекущиеДанные;  
	
	Массив = Новый Массив;
	Структура = Новый Структура;
	Структура.Вставить("Сотрудник", ТекушиеДанные.Сотрудник);
	Структура.Вставить("Подразделение", ТекушиеДанные.Подразделение);
	Структура.Вставить("ГрафикРаботы", ТекушиеДанные.ГрафикРаботы);  
	Структура.Вставить("ДатаНачала", ТекушиеДанные.ДатаНачала);
	Структура.Вставить("ДатаОкончания", ТекушиеДанные.ДатаОкончания); 
	Массив.Добавить(Структура);
	ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Массив, Объект.Дата);
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПроверитьСотрудникаНаГруппуСпециалист(Сотрудник, Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ВКМ_ДолжностиСотрудниковСрезПоследних.Должность КАК Должность,
	|	ВКМ_ДолжностиСотрудниковСрезПоследних.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ_Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_ДолжностиСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_ДолжностиСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сотрудник.Сотрудник КАК Сотрудник,
	|	ВКМ_КатегорииДолжности.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ВКМ_КатегорииДолжности.Ссылка = ЗНАЧЕНИЕ(Перечисление.ВКМ_КатегорииДолжности.Специалисты)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСпециалист,
	|	ВТ_Сотрудник.Подразделение КАК Подразделение
	|ИЗ
	|	ВТ_Сотрудник КАК ВТ_Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_ДолжностиСотрудников КАК ВКМ_ДолжностиСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ВКМ_КатегорииДолжности КАК ВКМ_КатегорииДолжности
	|			ПО ВКМ_ДолжностиСотрудников.Категория = ВКМ_КатегорииДолжности.Ссылка
	|		ПО ВТ_Сотрудник.Должность = ВКМ_ДолжностиСотрудников.Ссылка";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

&НаСервере
Процедура ОсновныеНачисленияСотрудникПриИзмененииНаСервере(Массив, Дата)
	
	Выборка_ЭтоСпециалист = ПроверитьСотрудникаНаГруппуСпециалист(Массив[0].Сотрудник, Дата);
	
	Если Выборка_ЭтоСпециалист.Следующий() Тогда 
		Выборка_ЭтоСпециалист.Следующий();
		ЭтоСпециалист = Выборка_ЭтоСпециалист.ЭтоСпециалист;
		
		Если ЭтоСпециалист Тогда
			
			Строка = Объект.ОсновныеНачисления.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Массив[0]);
			Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтВыполненыхРабот;
			
		КонецЕсли;
		
		Отбор = Новый Структура;
		Отбор.Вставить("Сотрудник", Массив[0].Сотрудник);
		НайденныеСтроки = Объект.ОсновныеНачисления.НайтиСтроки(Отбор);
		
		Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
			
			Для Каждого Строка Из НайденныеСтроки Цикл
				
				Строка.Подразделение = Выборка_ЭтоСпециалист.Подразделение;	
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

