#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура СоздатьИлиИзменитьЭлементСпрВКМ_УведомленияТелеграмБоту(НовыйЗаказ, Дата, ДатаПрроведенияРабот, Специалист, ВремяНачалаРаботПланируемое , ВремяОкончанияРаботПланируемое, Номер, МассивИзменений) Экспорт;
		
		
		НомерДокумента = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер); 
		ДатаДокумента = Формат(Дата, "ДЛФ=D");
		ДатаПроведенияРаботТекст = Формат(ДатаПрроведенияРабот,"ДЛФ=DD" );
		ВремяНачалаРабот = Лев(Формат(ВремяНачалаРаботПланируемое, "ДЛФ=T"),СтрДлина(Формат(ВремяНачалаРаботПланируемое, "ДЛФ=T"))- 3);
		ВремяОкончанияРабот = Лев(Формат(ВремяОкончанияРаботПланируемое, "ДЛФ=T"),СтрДлина(Формат(ВремяОкончанияРаботПланируемое, "ДЛФ=T")) - 3);
		
		
		НачалоСообщения = "";
		
		ТекстСообщения =  СтрШаблон("№ %1 от %2 %3 %3 Специалист: %4 &&Изменено_Специалист&&. %3 Планируемый период проведения работ: %3 Дата: %5 &&Изменено_ДатаПроведения&& %3 Время проведения: с %6 по %7 &&Изменено_ВремяПроведения&&", НомерДокумента, ДатаДокумента, Символы.ПС, Специалист, ДатаПроведенияРаботТекст, ВремяНачалаРабот, ВремяОкончанияРабот);
		
		Если НовыйЗаказ Тогда 
			НачалоСообщения = ("Создан заказ ""Обслуживание клиента""");
			
			ТекстСообщения = СтрШаблон("%1 %2",НачалоСообщения, ТекстСообщения);
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_Специалист&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ДатаПроведения&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ВремяПроведения&&", "");
		Иначе
			НачалоСообщения = ("Обновлен заказ ""Обслуживание клиента"" "); 
			
			ТекстСообщения = СтрШаблон("%1 %2",НачалоСообщения, ТекстСообщения);
			
			Для Каждого Изменение из МассивИзменений Цикл
				
				Если Изменение = "Специалист" Тогда
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_Специалист&&", "(специалист изменён)");	
				ИначеЕсли Изменение = "ДатаПроведения" Тогда
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ДатаПроведения&&", "(дата проведения перенесена)")	
				ИначеЕсли Изменение = "ВремяПроведения" Тогда  
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ВремяПроведения&&", "(время проведения работ изменено)")	
				КонецЕсли;
				
			КонецЦикла;   
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_Специалист&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ДатаПроведения&&", "");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&&Изменено_ВремяПроведения&&", "");
			
		КонецЕсли;
				
		СпрОбъект = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		
		СпрОбъект.Наименование = Неопределено;
		СпрОбъект.Код = Неопределено;
		СпрОбъект.ТекстСообщения = ТекстСообщения; 
		Попытка
			СпрОбъект.Записать(); 
			
			
			ВКМ_Телеграм.ОтправитьСообщениеВТелеграмКанал(ТекстСообщения);
		Исключение
			ЗаписьЖурналаРегистрации("Создание элемента спр.ВКМ_УведомленияТелеграмБоту",УровеньЖурналаРегистрации.Ошибка,Справочники.ВКМ_УведомленияТелеграмБоту,,"Не удалось создать элемент",);
		КонецПопытки;      
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли

