#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Если Не ЗначениеЗаполнено(Выплаты) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Для Каждого СтрокаТЧ Из Выплаты Цикл
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьРасход();
			Движение.Период = КонецМесяца(Дата);
			Движение.Сотрудник = СтрокаТЧ.Сотрудник;
			Движение.Сумма = СтрокаТЧ.Сумма;
			
		КонецЦикла;
		
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(Истина);
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		
		Ответственный = Пользователи.ТекущийПользователь();	
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	Процедура ЗаполнитьСуммуКВыплатеНаСервере() Экспорт
		ТЗ_Данные = ПолучитьСотрудниковИСуммыКВыплате();
		
		Если ЗначениеЗаполнено(ТЗ_Данные) Тогда
			Выплаты.Загрузить(ТЗ_Данные);	
		КонецЕсли;
		
	КонецПроцедуры
	
	Функция ПолучитьСотрудниковИСуммыКВыплате()
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоМесяца, &КонецМесяца, Месяц, , ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаОборот";
		
		Запрос.УстановитьПараметр("Дата", Дата); 
		Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Дата)); 
		Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));		
		ТЗ_СотрудникиИСуммы = Запрос.Выполнить().Выгрузить();
		
		Возврат ТЗ_СотрудникиИСуммы
		
	КонецФункции
	#КонецОбласти
	
#КонецЕсли
