#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий 
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Запрос = Новый Запрос();
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Должность КАК Должность,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Подразделение КАК Подразделение,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Сотрудник.Код КАК ТабельныйНомер,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.ДатаНазначения КАК ДатаНазначения
		|ИЗ
		|	Документ.ВКМ_НазначениеСотрудниковНаДолжности КАК ВКМ_НазначениеСотрудниковНаДолжности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_НазначениеСотрудниковНаДолжности.ДолжностиСотрудников КАК ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников
		|		ПО (ВКМ_НазначениеСотрудниковНаДолжностиВКМ_ДолжностиСотрудников.Ссылка = ВКМ_НазначениеСотрудниковНаДолжности.Ссылка)
		|ГДЕ
		|	ВКМ_НазначениеСотрудниковНаДолжности.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Движения.ВКМ_ДолжностиСотрудников.Записывать = Истина;
		
		Пока Выборка.Следующий() Цикл
			Движение = Движения.ВКМ_ДолжностиСотрудников.Добавить();
			Движение.Период = Выборка.ДатаНазначения;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.Должность = Выборка.Должность;
			Движение.Подразделение = Выборка.Подразделение; 
			Движение.ТабельныйНомер = Выборка.ТабельныйНомер;
		КонецЦикла;
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
		Ответственный = Пользователи.ТекущийПользователь();  
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли